In [1]:
import pandas as pd

# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [3]:
#Write your code here
path = r"D:\Code\Courses\# DEPI\Round 3\AMIT_ GIZ3_AIS4_G1\Technical\[21] Tue_9_09_2025\Pandas Practice assignment\Data\Purchase_Data.csv"
df_data = pd.read_csv(path)
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [5]:
#Write your code here
df_data.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [29]:
#Write you code here
result_1 = df_data.loc[:, ['invoice_number', 'invoice_time']]
result_1

      invoice_number   invoice_time
0       2.020000e+11  7/15/15 10:45
1       2.020000e+11  7/15/15 12:16
2       2.020000e+11  7/15/15 12:16
3       2.020000e+11  7/15/15 12:16
4       2.020000e+11  7/15/15 12:16
...              ...            ...
5377    2.020000e+11   9/5/15 23:07
5378    2.020000e+11   9/5/15 23:23
5379    2.020000e+11   9/5/15 23:24
5380    2.020000e+11   9/5/15 23:32
5381    2.020000e+11   9/5/15 23:38

[5382 rows x 2 columns]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [31]:
#Write you code here
result_2 = result_1.loc[:1]
result_2

   invoice_number   invoice_time
0    2.020000e+11  7/15/15 10:45
1    2.020000e+11  7/15/15 12:16

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [33]:
#Write your code here
result_3 = df_data.iloc[:4, :5]
result_3

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [35]:
#Write your code here
result_4 = df_data.loc[[0, 4, 6], ['invoice_time', 'price']]
result_4

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [43]:
num_rows = df_data.shape[0]
num_rows

5382

In [45]:
num_rows = len(df_data)
num_rows

5382

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [61]:
#Write your code here
df_data.tail(1)

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

In [69]:
df_data.loc[[num_rows-1]]

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
5381,2.020000e+11,9/5/15 23:38,G619,23030206,210101,1.0,2.0

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [94]:
#Write your code here
avg_price, max_price = df_data['price'].mean(), df_data['price'].max()
print(avg_price, max_price, sep='\n')

3.1920522110741363
6.01

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [100]:
#Write you code here
avg_price, avg_num_items = df_data[['price', 'num_item']].mean()
print(avg_price, avg_num_items, sep='\n')

3.1920522110741363
1.2983091787439613

Create a column called "total", which is the product of the price and num_item columns.

In [165]:
#Write your code here
df_data['total'] = df_data['num_item'] * df_data['price']
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price,total
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0,6.0

What is the avgerage price of the three most expensive purchases?

In [124]:
df_data['total'].sort_values(ascending=False).head(3).mean()

164.0

In [130]:
#Write your code here
df_data['total'].nlargest(3).mean()

164.0

How many different products are there?

In [134]:
#Write your code here
len(df_data['product_id'].value_counts())

53

In [138]:
len(df_data['product_id'].unique())

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [151]:
#Write your code here
print(df_data['total'].describe()['mean'])
print(df_data['total'].describe()['50%'])

3.931807878112784
3.0

Use the drop() method to delete the column total from the dataframe df_data.

In [167]:
#Write your code here
df_data.drop(
    columns='total',
    inplace=True
)
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [179]:
#Write your code here
df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])

C:\Users\hadys\AppData\Local\Temp\ipykernel_42948\3559894258.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df_data['invoice_time'] = pd.to_datetime(df_data['invoice_time'])

In [181]:
df_data.dtypes

invoice_number           float64
invoice_time      datetime64[ns]
store_id                  object
product_id                 int64
category_id                int64
num_item                 float64
price                    float64
dtype: object

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [203]:
#Write your code here
df_data.insert(
    loc= df_data.columns.get_loc('invoice_time') + 1,
    column= 'DOW',
    value= df_data['invoice_time'].dt.day_name()
)
df_data.insert(
    loc= df_data.columns.get_loc('invoice_time') + 2,
    column= 'Month',
    value= df_data['invoice_time'].dt.month_name()
)
df_data.head()

,invoice_number,invoice_time,DOW,Month,store_id,product_id,category_id,num_item,price
0,2.020000e+11,2015-07-15 10:45:00,Wednesday,July,G816,7000300,210101,1.0,2.0
1,2.020000e+11,2015-07-15 12:16:00,Wednesday,July,G816,7070884,70203,1.0,2.0
2,2.020000e+11,2015-07-15 12:16:00,Wednesday,July,G816,7070884,70203,1.0,2.0
3,2.020000e+11,2015-07-15 12:16:00,Wednesday,July,G816,7070891,70401,1.0,6.0
4,2.020000e+11,2015-07-15 12:16:00,Wednesday,July,G816,7090363,70401,1.0,6.0

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [209]:
#Write your code here
num_purchases_wed = df_data['DOW'].value_counts()['Wednesday']
num_purchases_wed

959

In [233]:
df = (
    df_data
    .groupby('DOW', as_index=False)
    .size()
)
df.query("DOW == 'Wednesday'")

         DOW  size
6  Wednesday   959

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [237]:
#Write your code here
path = r"D:\Code\Courses\# DEPI\Round 3\AMIT_ GIZ3_AIS4_G1\Technical\[21] Tue_9_09_2025\Pandas Practice assignment\Data\Titanic.csv"
df_titanic = pd.read_csv(path)
df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [241]:
#Write your code here
df_titanic.rename(
    columns={
        "Name": "Passenger_Name",
        "Ticket": "Ticket_Num"
    },
    inplace=True
)
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [249]:
print(df_titanic.index.name)

None

In [251]:
#Write your code here
df_titanic.set_index('PassengerId', inplace=True)

In [253]:
print(df_titanic.index.name)

PassengerId

In [255]:
df_titanic.head()

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [263]:
#Write your code here
df_titanic['Passenger_Name'][896]

'Hirvonen, Mrs. Alexander (Helga E Lindqvist)'

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [267]:
#Write your code here
df_titanic.reset_index(inplace=True)
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [275]:
#Write you code here
df_titanic['Age'].isnull().sum()

86

Compute the avg age of passengers ignoring the missing data.

In [277]:
#Write your code here
df_titanic['Age'].dropna().mean()

30.272590361445783

In [279]:
df_titanic['Age'].mean()  # mean() -> ignores the na

30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [285]:
#Write your code here
df_titanic['Age'].fillna(df_titanic['Age'].mean(), inplace=True)

C:\Users\hadys\AppData\Local\Temp\ipykernel_42948\925415045.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_titanic['Age'].fillna(df_titanic['Age'].mean(), inplace=True)

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [291]:
#Write your code here
df_titanic['Age'].sort_values(ascending=False).head(5).mean()

67.0

In [293]:
df_titanic['Age'].nlargest(5).mean()

67.0